{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "output_shape": [160, 320, 3], "output_shape_type": "raw", "trainable": true, "arguments": {}, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>t\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda"}}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "trainable": true, "cropping": [[50, 20], [0, 0]]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 5, "nb_row": 5, "name": "convolution2d_1", "subsample": [2, 2], "W_constraint": null, "bias": true, "b_regularizer": null, "nb_filter": 24, "border_mode": "valid", "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 5, "nb_row": 5, "name": "convolution2d_2", "subsample": [2, 2], "W_constraint": null, "bias": true, "b_regularizer": null, "nb_filter": 36, "border_mode": "valid", "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 5, "nb_row": 5, "name": "convolution2d_3", "subsample": [2, 2], "W_constraint": null, "bias": true, "b_regularizer": null, "nb_filter": 48, "border_mode": "valid", "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 3, "nb_row": 3, "name": "convolution2d_4", "subsample": [1, 1], "W_constraint": null, "bias": true, "b_regularizer": null, "nb_filter": 64, "border_mode": "valid", "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 3, "nb_row": 3, "name": "convolution2d_5", "subsample": [1, 1], "W_constraint": null, "bias": true, "b_regularizer": null, "nb_filter": 64, "border_mode": "valid", "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 100, "name": "dense_1", "W_constraint": null, "bias": true, "b_regularizer": null, "b_constraint": null, "input_dim": 8448, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"output_dim": 50, "name": "dense_2", "W_constraint": null, "bias": true, "b_regularizer": null, "b_constraint": null, "input_dim": 100, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"output_dim": 10, "name": "dense_3", "W_constraint": null, "bias": true, "b_regularizer": null, "b_constraint": null, "input_dim": 50, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 1, "name": "dense_4", "W_constraint": null, "bias": true, "b_regularizer": null, "b_constraint": null, "input_dim": 10, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "activation": "linear"}}]}