{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 160, 320, 3], "output_shape_type": "raw", "arguments": {}, "trainable": true, "output_shape": [160, 320, 3], "input_dtype": "float32", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>(\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda"}}, {"class_name": "Cropping2D", "config": {"trainable": true, "name": "cropping2d_1", "cropping": [[70, 25], [0, 0]]}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "W_constraint": null, "trainable": true, "subsample": [2, 2], "border_mode": "valid", "name": "convolution2d_1", "nb_filter": 24, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_row": 5, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_col": 5, "dim_ordering": "tf", "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "W_constraint": null, "trainable": true, "subsample": [2, 2], "border_mode": "valid", "name": "convolution2d_2", "nb_filter": 36, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_row": 5, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_col": 5, "dim_ordering": "tf", "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "W_constraint": null, "trainable": true, "subsample": [2, 2], "border_mode": "valid", "name": "convolution2d_3", "nb_filter": 48, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_row": 5, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_col": 5, "dim_ordering": "tf", "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "W_constraint": null, "trainable": true, "subsample": [1, 1], "border_mode": "valid", "name": "convolution2d_4", "nb_filter": 64, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_row": 3, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_col": 3, "dim_ordering": "tf", "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "W_constraint": null, "trainable": true, "subsample": [1, 1], "border_mode": "valid", "name": "convolution2d_5", "nb_filter": 64, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_row": 3, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_col": 3, "dim_ordering": "tf", "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "W_constraint": null, "trainable": true, "input_dim": 2112, "output_dim": 100, "name": "dense_1", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "linear", "W_constraint": null, "trainable": true, "input_dim": 100, "output_dim": 50, "name": "dense_2", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "linear", "W_constraint": null, "trainable": true, "input_dim": 50, "output_dim": 10, "name": "dense_3", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}}, {"class_name": "Dense", "config": {"activation": "linear", "W_constraint": null, "trainable": true, "input_dim": 10, "output_dim": 1, "name": "dense_4", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "bias": true}}]}